// Напишите программу, которая на вход принимает значение, а на выходе показывает обратное значение.

Console.Write("Введите число: ");
double num = double.Parse(Console.ReadLine());

Console.WriteLine(1 / num);
